/*
 * status.c
 *
 *  Created on: 22 февр. 2021 г.
 *      Author: 79110
 */
/*--------------------------------- Includes ---------------------------------*/
#include "status.h"
#include "engine.h"
#include "controller.h"
/*-------------------------------- Structures --------------------------------*/
/*--------------------------------- Constant ---------------------------------*/
/*-------------------------------- Variables ---------------------------------*/
/*-------------------------------- External ----------------------------------*/
/*-------------------------------- Functions ---------------------------------*/

/*----------------------------------------------------------------------------*/
/*----------------------- PRIVATE --------------------------------------------*/
/*----------------------------------------------------------------------------*/
PERMISSION eSTATUSisTimer ( DEVICE_STATUS status )
{
  PERMISSION res = PERMISSION_ENABLE;
  if ( ( status == DEVICE_STATUS_IDLE           ) ||
       ( status == DEVICE_STATUS_READY_TO_START ) ||
       ( status == DEVICE_STATUS_WORKING        ) ||
       ( status == DEVICE_STATUS_EMERGENCY_STOP ) ||
       ( status == DEVICE_STATUS_BAN_START      ) )
  {
    res = PERMISSION_DISABLE;
  }
  return res;
}
/*----------------------------------------------------------------------------*/
/*----------------------- PABLIC ---------------------------------------------*/
/*----------------------------------------------------------------------------*/
void vSTATUSget ( DEVICE_STATUS* status, PERMISSION* timer, fix16_t time )
{
  STARTER_STATUS   starter  = STARTER_IDLE;
  PLAN_STOP_STATUS planStop = STOP_IDLE;
  ENGINE_STATUS    engine   = eENGINEgetEngineStatus();

  return;
}
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
